print('Шляпка гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... плёнкой. Когда её уберёшь, откроется нижняя ... сторона шляпк.. .')

word_1 = (str(input("вставьте 1 слово:"))) 
b_1 = (str(input("вставьте 1 букву:")))
word_2 = (str(input("вставьте 2 слово:")))
b_2 = (str(input("вставьте 2 букву:")))
word_3 = (str(input("вставьте 3 слово:")))
word_4 = (str(input("вставьте 4 слово:")))
b_3 = (str(input("вставьте 3 букву:")))

print(f'Шляпка гриба, покрытая {word_1} кожиц{b_2}й, держится на {word_2} ножк{b_2}. Снизу шляпка затянута {word_3} плёнкой. Когда её уберёшь, откроется нижняя {word_4} сторона шляпк{b_3}.')






